Yorha9e/Golang-Im-Neo/esp32/sdkconfig.defaults
# sdkconfig.defaults — sensible C3 defaults for the IM hardware client.
# Apply: idf.py set-target esp32c3  (then menuconfig "ESP32 IM Client").
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# Keep the websocket task + link task roomy: the WsMessage struct alone is
# ~1 KB and the base-size probe path holds two of them transiently.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
